///*******************************************************************************
//* タイトル:		キムジュンデンセツ(3)
//* プログラム名:	fade.h
//* 作成者:			GP11B292 08 キムラジュン
//********************************************************************************/
#pragma once


//*************************************
// フェードの状態
//*************************************
enum FADE
{
	FADE_NONE = 0,		// 何もない状態
	FADE_IN,			// フェードイン処理
	FADE_MUSIC_STOP,
	FADE_OUT,			// フェードアウト処理
	FADE_MAX
};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitFade(int type);
void UninitFade(void);
void UpdateFade(void);
void DrawFade(void);
void SetFade(FADE fade, E_STAGE next, int sno);
FADE GetFade(void);

